---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeVertex.Dispose
source: html/f2b36a45-4029-8bcf-1dd5-91d9e8c38124.htm
---
# Autodesk.Revit.DB.SlabShapeVertex.Dispose Method

Releases all resources used by the SlabShapeVertex

## Syntax (C#)
```csharp
public void Dispose()
```